conf/src/BusinessProcesses/ЭП_Заявки/ЭП_Заявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ЭП_Заявки</name>
  <task>Task.ЭП_ЗадачиЗаявок</task>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ЭП_ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.ЭП_Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯХочу</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯДелаю</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯПолучаю</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.ЭП_СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаВыполнениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>EnumRef.ЭП_ИсполнителиЗаявок</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролирующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удовлетворительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСообщения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительЗадачи</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЭП_СтатусыЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредоставляемаяТехника</name>
    <attributes>
      <name>Техника</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ЭП_ВидыТехникиДляЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

conf/src/BusinessProcesses/ЭП_Заявки/Forms/ФормаСпискаМоиЗаявки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПользователиКлиентСервер.ТекущийПользователь()); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборПоСтатусуДобавлениеМножественныхЗначений(Элемент, Значения, СтандартнаяОбработка)
	
	МассивСтатусов = Новый Массив();
	Для каждого Статус из ОтборПоСтатусу Цикл
		МассивСтатусов.Добавить(Статус.Значение);
	КонецЦикла;
	МассивСтатусов.Добавить(Значения[0]);
	ИсторияИзмененияСтатусов.Добавить(ИсторияИзмененияСтатусов.Количество(),Значения[0]);
	ЗаполнитьСписок(МассивСтатусов, ОтборПоТипу, ПоказатьВсе);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)
	
	МассивСтатусов = Новый Массив(); 
	УдалитьСтатус = ИсторияИзмененияСтатусов[Идентификаторы[0]].Представление;
	Для каждого Статус из ОтборПоСтатусу Цикл
		Если Строка(Статус.Значение) <> УдалитьСтатус Тогда
			МассивСтатусов.Добавить(Статус.Значение);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСписок(МассивСтатусов, ОтборПоТипу, ПоказатьВсе);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуДобавлениеМножественныхЗначений(Элемент, Значения, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив();
	Для каждого Тип из ОтборПоТипу Цикл
		МассивТипов.Добавить(Тип.Значение);
	КонецЦикла;
	МассивТипов.Добавить(Значения[0]);
	ИсторияИзмененияТипов.Добавить(ИсторияИзмененияТипов.Количество(),Значения[0]);
	ЗаполнитьСписок(ОтборПоСтатусу, МассивТипов, ПоказатьВсе);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив(); 
	УдалитьТип = ИсторияИзмененияТипов[Идентификаторы[0]].Представление;
	Для каждого Тип из ОтборПоТипу Цикл
		Если Строка(Тип.Значение) <> УдалитьТип Тогда
			МассивТипов.Добавить(Тип.Значение);
		КонецЕсли;
	КонецЦикла; 
	ЗаполнитьСписок(ОтборПоСтатусу, МассивТипов, ПоказатьВсе);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок(ОтборПоСтатусу, ОтборПоТипу, ПоказатьВсе)
	
	ЭтаФорма.Список.Отбор.Элементы.Очистить();
	
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипЗаявки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ОтборПоТипу);
	ЭлементОтбора.ПравоеЗначение = ОтборПоТипу;
		
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусЗаявки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = ЗначениеЗаполнено(ОтборПоСтатусу);
	ЭлементОтбора.ПравоеЗначение = ОтборПоСтатусу;
		
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Завершен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Не ПоказатьВсе;
	ЭлементОтбора.ПравоеЗначение = ПоказатьВсе;
	
	//Список.ТекстЗапроса = "ВЫБРАТЬ
	//|	ЭП_Заявки.Дата КАК Дата,
	//|	ЭП_Заявки.Номер КАК Номер,
	//|	ЭП_Заявки.Исполнитель КАК Исполнитель,
	//|	ЭП_Заявки.Заявитель КАК Заявитель,
	//|	ЭП_Заявки.ТипЗаявки КАК ТипЗаявки,
	//|	ЭП_Заявки.СтатусЗаявки КАК СтатусЗаявки,
	//|	ЭП_Заявки.Ссылка КАК Заявка
	//|ИЗ
	//|	БизнесПроцесс.ЭП_Заявки КАК ЭП_Заявки
	//|ГДЕ 
	//|   ЭП_Заявки.Заявитель = &ТекущийПользователь И 
	//|	(&НеИспользоватьСтатусыЗаявок
	//|			ИЛИ ЭП_Заявки.СтатусЗаявки В (&МассивСтатусовЗаявки))
	//|	И (&НеИспользоватьТипыЗаявок
	//|			ИЛИ ЭП_Заявки.ТипЗаявки В (&МассивТиповЗаявки))
	//|   И (&ПоказатьВсе
	//|			ИЛИ не ЭП_Заявки.Завершен)
	//|
	//|";
	//
	//Список.Параметры.УстановитьЗначениеПараметра("МассивСтатусовЗаявки", ОтборПоСтатусу);
	//Список.Параметры.УстановитьЗначениеПараметра("МассивТиповЗаявки", ОтборПоТипу);
	//
	//Если ОтборПоСтатусу.Количество() = 0 Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьСтатусыЗаявок", Истина);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьСтатусыЗаявок", Ложь);
	//КонецЕсли;
	//
	//Если ОтборПоТипу.Количество() = 0 Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьТипыЗаявок", Истина);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьТипыЗаявок", Ложь);
	//КонецЕсли;
	//
	//Если ПоказатьВсе Тогда	
	//	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", Истина);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", Ложь);	
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)  
	
	 ЗаполнитьСписок(ОтборПоСтатусу, ОтборПоТипу, ПоказатьВсе); 
	 
КонецПроцедуры
